app/Controllers/Pages.php

SELECT *
FROM `tasks`
WHERE task_date = DATE(NOW())
---
    public function index()
    {
        $model = new TasksModel();

        $data = [
            'Tasks' => $model
            ->where('task_date = DATE(NOW())')
            ->findAll()
        ];