app/Controllers/Profile.php

    public function index()
    {
        $model = new UserModel();

        $data = [
            'user' => $model
            ->find(1)
        ];
---
SELECT *
FROM `users`
WHERE `users`.`id` = 1