app/Controllers/Tasks.php

SELECT *
FROM `tasks`
ORDER BY `task_date` DESC
---
    public function index()
    {
        $model = new TasksModel();

        $data = [
            'Tasks' => $model
            ->orderBy('task_date', 'DESC')
            ->findAll()
        ];